In [1]:
# read and write using pandas

In [9]:
import os

In [8]:
import pandas as pd

draft1 = pd.read_csv('/Users/sudhanshukumar/Downloads/auto-data.csv')    # Supply the file name (path)
draft1.head(9)

,MAKE,FUELTYPE,ASPIRE,DOORS,BODY,DRIVE,CYLINDERS,HP,RPM,MPG-CITY,MPG-HWY,PRICE
0,subaru,gas,std,two,hatchback,fwd,four,69,4900,31,36,5118
1,chevrolet,gas,std,two,hatchback,fwd,three,48,5100,47,53,5151
2,mazda,gas,std,two,hatchback,fwd,four,68,5000,30,31,5195
3,toyota,gas,std,two,hatchback,fwd,four,62,4800,35,39,5348
4,mitsubishi,gas,std,two,hatchback,fwd,four,68,5500,37,41,5389
5,honda,gas,std,two,hatchback,fwd,four,60,5500,38,42,5399
6,nissan,gas,std,two,sedan,fwd,four,69,5200,31,37,5499
7,dodge,gas,std,two,hatchback,fwd,four,68,5500,37,41,5572
8,plymouth,gas,std,two,hatchback,fwd,four,68,5500,37,41,5572

In [11]:
draft3 = pd.read_excel('/Users/sudhanshukumar/Downloads/mastersheet.xlsx',sheetname = 'python') # Name of sheet to read from

draft3                         # Check the first 6 rows

/Users/sudhanshukumar/anaconda3/lib/python3.7/site-packages/pandas/io/excel.py:329: FutureWarning: The `sheetname` keyword is deprecated, use `sheet_name` instead
  **kwds)

                                               Python
0                                              Pandas
1                                              Series
2                                          Data frame
3                                               Panel
4                                    Python turtorial
5   https://docs.python.org/3/library/stdtypes.htm...
6                                     Pandas tutorial
7   https://pandas.pydata.org/pandas-docs/stable/v...
8                                     Scikit tutorial
9   http://scikit-learn.org/stable/tutorial/index....
10     http://scikit-learn.org/stable/user_guide.html
11  https://stackoverflow.com/questions/40464512/d...
12                          For parent child mappping
13                                   Machine learning
14  https://deeplearning4j.org/generative-adversar...
15    https://skymind.ai/ai-infrastructure-mlops.html
16                                       Python udemy
17                    https://github.com/Pierian-Data
18  https://www.analyticsvidhya.com/blog/2018/05/2...
19                                    for core python
20  https://www.programiz.com/python-programming/a...

In [ ]:
draft4 = pd.read_excel('/Users/sudhanshukumar/Downloads/mastersheet.xlsx',sheetname = 'python')

In [13]:
url = "http://www.basketball-reference.com/leagues/NBA_2015_totals.html"

BB_data = pd.read_html(url)         # Read data from the specified url

BB_data[0].ix[:, 0:10].head(10) 

# Check 5 rows (10 columns only)

/Users/sudhanshukumar/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:5: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """

  Rk          Player Pos Age   Tm   G  GS    MP   FG  FGA
0  1      Quincy Acy  PF  24  NYK  68  22  1287  152  331
1  2    Jordan Adams  SG  20  MEM  30   0   248   35   86
2  3    Steven Adams   C  21  OKC  70  67  1771  217  399
3  4     Jeff Adrien  PF  28  MIN  17   0   215   19   44
4  5   Arron Afflalo  SG  29  TOT  78  72  2502  375  884
5  5   Arron Afflalo  SG  29  DEN  53  53  1750  281  657
6  5   Arron Afflalo  SG  29  POR  25  19   752   94  227
7  6   Alexis Ajinca   C  26  NOP  68   8   957  181  329
8  7  Furkan Aldemir  PF  23  PHI  41   9   540   40   78
9  8    Cole Aldrich   C  26  NYK  61  16   976  144  301

In [17]:
#save data to 
draft1.to_csv("xyz.csv")

In [1]:
import numpy as np
import pandas as pd
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')

In [3]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
l =['Pclass','Fare','Survived']
titanic_train[l].head(8)

   Pclass     Fare  Survived
0       3   7.2500         0
1       1  71.2833         1
2       3   7.9250         1
3       1  53.1000         1
4       3   8.0500         0
5       3   8.4583         0
6       1  51.8625         0
7       3  21.0750         0

In [6]:
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [7]:
categorical = titanic_train.dtypes[titanic_train.dtypes == "object"].index
print(categorical)

titanic_train[categorical].head()

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S

In [8]:
del titanic_train["PassengerId"]  

titanic_train.head()
# Remove PassengerId

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
sorted(titanic_train["Name"])[5:15]  # Check the first 15 sorted names

['Andersson, Mr. August Edvard ("Wennerstrom")',
 'Andreasson, Mr. Paul Edvin',
 'Andrew, Mr. Edgardo Samuel',
 'Arnold-Franchi, Mrs. Josef (Josefine Franchi)',
 'Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)',
 'Attalah, Miss. Malake',
 'Backstrom, Mrs. Karl Alfred (Maria Mathilda Gustafsson)',
 'Barton, Mr. David John',
 'Bateman, Rev. Robert James',
 'Baxter, Mr. Quigg Edmond']

In [10]:
titanic_train["Name"].describe()

count                        156
unique                       156
top       Barton, Mr. David John
freq                           1
Name: Name, dtype: object

In [11]:
titanic_train["Ticket"][0:15]       # Check the first 15 tickets

0            A/5 21171
1             PC 17599
2     STON/O2. 3101282
3               113803
4               373450
5               330877
6                17463
7               349909
8               347742
9               237736
10             PP 9549
11              113783
12           A/5. 2151
13              347082
14              350406
Name: Ticket, dtype: object

In [12]:
titanic_train["Ticket"].describe()

count        156
unique       145
top       113803
freq           2
Name: Ticket, dtype: object

In [13]:
del titanic_train["Ticket"]        # Remove Ticket

In [14]:
titanic_train["Cabin"][0:15]       # Check the first 15 tickets

0      NaN
1      C85
2      NaN
3     C123
4      NaN
5      NaN
6      E46
7      NaN
8      NaN
9      NaN
10      G6
11    C103
12     NaN
13     NaN
14     NaN
Name: Cabin, dtype: object

In [15]:
titanic_train["Cabin"].describe()  # Check number of unique cabins

count              31
unique             28
top       C23 C25 C27
freq                2
Name: Cabin, dtype: object

In [16]:
new_survived = pd.Categorical(titanic_train["Survived"])
#new_survived = new_survived.rename_categories([5,9])              

new_survived

[0, 1, 1, 1, 0, ..., 1, 0, 0, 0, 0]
Length: 156
Categories (2, int64): [0, 1]

In [17]:
titanic_train["Survived"]

0      0
1      1
2      1
3      1
4      0
5      0
6      0
7      0
8      1
9      1
10     1
11     1
12     0
13     0
14     0
15     1
16     0
17     1
18     0
19     1
20     0
21     1
22     1
23     1
24     0
25     1
26     0
27     0
28     1
29     0
      ..
126    0
127    1
128    1
129    0
130    0
131    0
132    0
133    1
134    0
135    0
136    1
137    0
138    0
139    0
140    0
141    1
142    1
143    0
144    0
145    0
146    1
147    0
148    0
149    0
150    0
151    1
152    0
153    0
154    0
155    0
Name: Survived, Length: 156, dtype: int64

In [18]:
titanic_train.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Cabin', 'Embarked'],
      dtype='object')

In [19]:
titanic_train['Pclass']

0      3
1      1
2      3
3      1
4      3
5      3
6      1
7      3
8      3
9      2
10     3
11     1
12     3
13     3
14     3
15     2
16     3
17     2
18     3
19     3
20     2
21     2
22     3
23     1
24     3
25     3
26     3
27     1
28     3
29     3
      ..
126    3
127    3
128    3
129    3
130    3
131    3
132    3
133    2
134    2
135    2
136    1
137    1
138    3
139    1
140    3
141    3
142    3
143    3
144    2
145    2
146    3
147    3
148    2
149    2
150    2
151    1
152    3
153    3
154    3
155    1
Name: Pclass, Length: 156, dtype: int64

In [20]:
new_Pclass = pd.Categorical(titanic_train["Pclass"])

new_Pclass = new_Pclass.rename_categories(["Class3","Class2","Class1"])     

new_Pclass

[Class1, Class3, Class1, Class3, Class1, ..., Class3, Class1, Class1, Class1, Class3]
Length: 156
Categories (3, object): [Class3, Class2, Class1]

In [21]:
titanic_train.dtypes

Survived      int64
Pclass        int64
Name         object
Sex          object
Age         float64
SibSp         int64
Parch         int64
Fare        float64
Cabin        object
Embarked     object
dtype: object

In [22]:
titanic_train["Cabin"].unique()   # Check unique cabins

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2'], dtype=object)

In [23]:
char_cabin = titanic_train["Cabin"].astype(str) # Convert data to str

new_Cabin = np.array([cabin[0] for cabin in char_cabin]) # Take first letter

new_Cabin = pd.Categorical(new_Cabin)

titanic_train["Cabin"]

0              NaN
1              C85
2              NaN
3             C123
4              NaN
5              NaN
6              E46
7              NaN
8              NaN
9              NaN
10              G6
11            C103
12             NaN
13             NaN
14             NaN
15             NaN
16             NaN
17             NaN
18             NaN
19             NaN
20             NaN
21             D56
22             NaN
23              A6
24             NaN
25             NaN
26             NaN
27     C23 C25 C27
28             NaN
29             NaN
          ...
126            NaN
127            NaN
128          F E69
129            NaN
130            NaN
131            NaN
132            NaN
133            NaN
134            NaN
135            NaN
136            D47
137           C123
138            NaN
139            B86
140            NaN
141            NaN
142            NaN
143            NaN
144            NaN
145            NaN
146            NaN
147            NaN
148             F2
149            NaN
150            NaN
151             C2
152            NaN
153            NaN
154            NaN
155            NaN
Name: Cabin, Length: 156, dtype: object

In [24]:
titanic_train["Cabin"] = new_Cabin
titanic_train["Cabin"]

0      n
1      C
2      n
3      C
4      n
5      n
6      E
7      n
8      n
9      n
10     G
11     C
12     n
13     n
14     n
15     n
16     n
17     n
18     n
19     n
20     n
21     D
22     n
23     A
24     n
25     n
26     n
27     C
28     n
29     n
      ..
126    n
127    n
128    F
129    n
130    n
131    n
132    n
133    n
134    n
135    n
136    D
137    C
138    n
139    B
140    n
141    n
142    n
143    n
144    n
145    n
146    n
147    n
148    F
149    n
150    n
151    C
152    n
153    n
154    n
155    n
Name: Cabin, Length: 156, dtype: category
Categories (8, object): [A, B, C, D, E, F, G, n]

In [25]:
dummy_vector = pd.Series([1,None,3,None,7,8])

dummy_vector.isnull()

0    False
1     True
2    False
3     True
4    False
5    False
dtype: bool

In [26]:
missing = np.where(titanic_train["Age"].isnull() == True)
missing[0][0]

5

In [33]:
titanic_train["Fare"]==max(titanic_train["Fare"])

0      False
1      False
2      False
3      False
4      False
5      False
6      False
7      False
8      False
9      False
10     False
11     False
12     False
13     False
14     False
15     False
16     False
17     False
18     False
19     False
20     False
21     False
22     False
23     False
24     False
25     False
26     False
27      True
28     False
29     False
       ...
126    False
127    False
128    False
129    False
130    False
131    False
132    False
133    False
134    False
135    False
136    False
137    False
138    False
139    False
140    False
141    False
142    False
143    False
144    False
145    False
146    False
147    False
148    False
149    False
150    False
151    False
152    False
153    False
154    False
155    False
Name: Fare, Length: 156, dtype: bool

In [34]:
len(missing[0])

30

In [35]:
index = np.where(titanic_train["Fare"] == max(titanic_train["Fare"]) )
index
titanic_train.loc[index]
titanic_train.loc[[1,8,10,11]]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,C
8,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,11.1333,n,S
10,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,16.7000,G,S
11,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,26.5500,C,S

In [30]:
titanic_train["Family"] = titanic_train["SibSp"] + titanic_train["Parch"]

most_family = np.where(titanic_train["Family"] == max(titanic_train["Family"]))

titanic_train.ix[most_family]

/Users/sudhanshukumar/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:5: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Family
59,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,46.9,n,S,7
71,0,3,"Goodwin, Miss. Lillian Amy",female,16.0,5,2,46.9,n,S,7

In [39]:
import numpy as np
import pandas as pd

labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

print ("Labels:", labels)
print("My data:", my_data)
print("Dictionary:", d)

Labels: ['a', 'b', 'c']
My data: [10, 20, 30]
Dictionary: {'a': 10, 'b': 20, 'c': 30}

In [40]:
pd.Series(my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [41]:
print ("\nHolding numerical data\n",'-'*25, sep='')
print(pd.Series(arr))

Holding numerical data
-------------------------
0    10
1    20
2    30
dtype: int64

In [42]:
print ("\nHolding text labels\n",'-'*20, sep='')
print(pd.Series(labels))

Holding text labels
--------------------
0    a
1    b
2    c
dtype: object

In [45]:

d = {'a':10,'b':20,'c':30}
d.keys
d.items
d.values

In [42]:
print ("\nHolding objects from a dictionary\n",'-'*40, sep='')
print(pd.Series([d.keys, d.items, d.values]))

Holding objects from a dictionary
----------------------------------------
0    <built-in method keys of dict object at 0x1242...
1    <built-in method items of dict object at 0x124...
2    <built-in method values of dict object at 0x12...
dtype: object

In [43]:
ser1 = pd.Series([1,2,3,4],['CA', 'OR', 'CO', 'AZ'])
ser2 = pd.Series([1,2,5,4],['CA', 'OR', 'NV', 'AZ'])
ser1

CA    1
OR    2
CO    3
AZ    4
dtype: int64

In [44]:
print ("\nIndexing by name of the item/object (string identifier)\n",'-'*56, sep='')
print("Value for CA in ser1:", ser1[3])
print("Value for AZ in ser1:", ser1['AZ'])
print("Value for NV in ser2:", ser2['NV'])

Indexing by name of the item/object (string identifier)
--------------------------------------------------------
Value for CA in ser1: 4
Value for AZ in ser1: 4
Value for NV in ser2: 5

In [45]:
print ("\nIndexing by number (positional value in the series)\n",'-'*52, sep='')
print("Value for CA in ser1:", ser1[0])
print("Value for AZ in ser1:", ser1[3])
print("Value for NV in ser2:", ser2[2])
ser1

Indexing by number (positional value in the series)
----------------------------------------------------
Value for CA in ser1: 1
Value for AZ in ser1: 4
Value for NV in ser2: 5

CA    1
OR    2
CO    3
AZ    4
dtype: int64

In [46]:
print ("\nIndexing by a range\n",'-'*25, sep='')
print ("Value for OR, CO, and AZ in ser1:\n", ser1[1:3], sep='')

Indexing by a range
-------------------------
Value for OR, CO, and AZ in ser1:
OR    2
CO    3
dtype: int64

In [47]:
ser1 = pd.Series([1,2,3,4],['CA', 'OR', 'CO', 'AZ'])
ser2 = pd.Series([1,2,5,4],['CA', 'OR', 'NV', 'AZ'])
ser3 = ser1+ser2

In [48]:
print ("\nAfter adding the two series, the result looks like this...\n",'-'*59, sep='')
print(ser3)
print("\nPython tries to add values where it finds common index name, and puts NaN where indices are missing\n")

After adding the two series, the result looks like this...
-----------------------------------------------------------
AZ    8.0
CA    2.0
CO    NaN
NV    NaN
OR    4.0
dtype: float64

Python tries to add values where it finds common index name, and puts NaN where indices are missing

In [49]:
print ("\nThe idea works even for multiplication...\n",'-'*43, sep='')
print (ser1*ser2)

The idea works even for multiplication...
-------------------------------------------
AZ    16.0
CA     1.0
CO     NaN
NV     NaN
OR     4.0
dtype: float64

In [50]:
print ("\nOr even for combination of mathematical operations!\n",'-'*53, sep='')
print (np.exp(ser1)+np.log10(ser2))

Or even for combination of mathematical operations!
-----------------------------------------------------
AZ    55.200210
CA     2.718282
CO          NaN
NV          NaN
OR     7.690086
dtype: float64

In [51]:
from numpy.random import randn as rn
#np.random.seed(101)
matrix_data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']

df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
#print("\nThe data frame looks like\n",'-'*45, sep='')
print(df)
df.loc[["D","A"]]

          W         X         Y         Z
A  1.001906  0.943370 -0.258402  0.676482
B -0.634947 -0.732321  0.520497  0.236402
C -0.777249  0.165330 -0.265424 -2.183972
D  0.396964 -0.158034 -0.217739  0.426768
E  0.045613 -1.196055  0.456499  0.284715

          W         X         Y         Z
D  0.396964 -0.158034 -0.217739  0.426768
A  1.001906  0.943370 -0.258402  0.676482

In [52]:
print("\nThe 'X' column\n",'-'*25, sep='')
print(df['X'])

The 'X' column
-------------------------
A    0.943370
B   -0.732321
C    0.165330
D   -0.158034
E   -1.196055
Name: X, dtype: float64

In [53]:
print("\nType of the column: ", type(df['X']), sep='')
print("\nThe 'X' and 'Z' columns indexed by passing a list\n",'-'*55, sep='')
print(df[['X','Z']])

Type of the column: <class 'pandas.core.series.Series'>

The 'X' and 'Z' columns indexed by passing a list
-------------------------------------------------------
          X         Z
A  0.943370  0.676482
B -0.732321  0.236402
C  0.165330 -2.183972
D -0.158034  0.426768
E -1.196055  0.284715

In [54]:
print("\nType of the pair of columns: ", type(df[['X','Z']]), sep='')
print ("\nSo, for more than one column, the object turns into a DataFrame")

Type of the pair of columns: <class 'pandas.core.frame.DataFrame'>

So, for more than one column, the object turns into a DataFrame

In [55]:
print("\nThe 'X' column accessed by DOT method (NOT recommended)\n",'-'*55, sep='')
print(df["X"])

The 'X' column accessed by DOT method (NOT recommended)
-------------------------------------------------------
A    0.943370
B   -0.732321
C    0.165330
D   -0.158034
E   -1.196055
Name: X, dtype: float64

In [56]:
print("\nA column is created by assigning it in relation to an existing column\n",'-'*75, sep='')
df['New'] = df['X']+df['Z']
df['New (Sum of X and Z)'] = df['X']+df['Z']
print(df)

A column is created by assigning it in relation to an existing column
---------------------------------------------------------------------------
          W         X         Y         Z       New  New (Sum of X and Z)
A  1.001906  0.943370 -0.258402  0.676482  1.619852              1.619852
B -0.634947 -0.732321  0.520497  0.236402 -0.495919             -0.495919
C -0.777249  0.165330 -0.265424 -2.183972 -2.018642             -2.018642
D  0.396964 -0.158034 -0.217739  0.426768  0.268733              0.268733
E  0.045613 -1.196055  0.456499  0.284715 -0.911340             -0.911340

In [57]:
print("\nA column is dropped by using df.drop() method\n",'-'*55, sep='')
df.drop('A',inplace=True) # Notice the axis=1 option, axis = 0 is default, so one has to change it to 1

A column is dropped by using df.drop() method
-------------------------------------------------------

In [58]:
df

          W         X         Y         Z       New  New (Sum of X and Z)
B -0.634947 -0.732321  0.520497  0.236402 -0.495919             -0.495919
C -0.777249  0.165330 -0.265424 -2.183972 -2.018642             -2.018642
D  0.396964 -0.158034 -0.217739  0.426768  0.268733              0.268733
E  0.045613 -1.196055  0.456499  0.284715 -0.911340             -0.911340

In [59]:
df1=df.drop('A')
print("\nA row (index) is dropped by using df.drop() method and axis=0\n",'-'*65, sep='')
print(df1)

KeyError: "['A'] not found in axis"

In [60]:
print("\nAn in-place change can be done by making inplace=True in the drop method\n",'-'*75, sep='')
df.drop('New (Sum of X and Z)', axis=1, inplace=True)
print(df)

An in-place change can be done by making inplace=True in the drop method
---------------------------------------------------------------------------
          W         X         Y         Z       New
B -0.634947 -0.732321  0.520497  0.236402 -0.495919
C -0.777249  0.165330 -0.265424 -2.183972 -2.018642
D  0.396964 -0.158034 -0.217739  0.426768  0.268733
E  0.045613 -1.196055  0.456499  0.284715 -0.911340

In [61]:
### Selecting/indexing Rows
#* Label-based 'loc' method
#* Index (numeric) 'iloc' method
df

          W         X         Y         Z       New
B -0.634947 -0.732321  0.520497  0.236402 -0.495919
C -0.777249  0.165330 -0.265424 -2.183972 -2.018642
D  0.396964 -0.158034 -0.217739  0.426768  0.268733
E  0.045613 -1.196055  0.456499  0.284715 -0.911340

In [62]:
print("\nLabel-based 'loc' method can be used for selecting row(s)\n",'-'*60, sep='')
print("\nSingle row\n")
print(df.iloc[0])

Label-based 'loc' method can be used for selecting row(s)
------------------------------------------------------------

Single row

W     -0.634947
X     -0.732321
Y      0.520497
Z      0.236402
New   -0.495919
Name: B, dtype: float64

In [63]:
print("\nMultiple rows\n")
print(df.loc[['B','C']])

Multiple rows

          W         X         Y         Z       New
B -0.634947 -0.732321  0.520497  0.236402 -0.495919
C -0.777249  0.165330 -0.265424 -2.183972 -2.018642

In [64]:
print("\nIndex position based 'iloc' method can be used for selecting row(s)\n",'-'*70, sep='')
print("\nSingle row\n")
print(df.iloc[2])

Index position based 'iloc' method can be used for selecting row(s)
----------------------------------------------------------------------

Single row

W      0.396964
X     -0.158034
Y     -0.217739
Z      0.426768
New    0.268733
Name: D, dtype: float64

In [65]:
print("\nMultiple rows\n")
print(df.iloc[[1,2]])

Multiple rows

          W         X         Y         Z       New
C -0.777249  0.165330 -0.265424 -2.183972 -2.018642
D  0.396964 -0.158034 -0.217739  0.426768  0.268733

In [66]:
#### Subsetting DataFrame

In [67]:
np.random.seed(101)
matrix_data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)

In [68]:
print("\nThe DatFrame\n",'-'*45, sep='')
print(df)

The DatFrame
---------------------------------------------
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [69]:
print("\nElement at row 'B' and column 'Y' is\n") 
print(df.loc['B','Y'])

Element at row 'B' and column 'Y' is

-0.8480769834036315

In [70]:
print("\nSubset comprising of rows B and D, and columns W and Y, is\n")
df.iloc[[1,2,3],[0,1]]

Subset comprising of rows B and D, and columns W and Y, is

          W         X
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872

In [71]:
print("\nThe DataFrame\n",'-'*45, sep='')
print(df)

The DataFrame
---------------------------------------------
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [72]:
print("\nBoolean DataFrame(s) where we are checking if the values are greater than 0\n",'-'*75, sep='')
print(df>0)

Boolean DataFrame(s) where we are checking if the values are greater than 0
---------------------------------------------------------------------------
       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [73]:
print("\n")
print(df.loc[['A','B','C']]>0)

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False

In [74]:
booldf = df>0
print("\nDataFrame indexed by boolean dataframe\n",'-'*45, sep='')
print(df[booldf])

DataFrame indexed by boolean dataframe
---------------------------------------------
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [75]:
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']

In [76]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nA new DataFrame\n",'-'*25, sep='')
print(df)

A new DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [98]:
print("\nRows with Height > 65 inch\n",'-'*35, sep='')
print(df[df['Height']>65])

Rows with Height > 65 inch
-----------------------------------
   Age  Height  Weight Profession
A   22      66     140    Student
B   42      70     148    Teacher
D   35      68     160     Doctor

In [97]:
df['Height']>65

A     True
B     True
C    False
D     True
E    False
Name: Height, dtype: bool

In [78]:
booldf1 = df['Height']>65
booldf2 = df['Weight']>145

In [100]:
print("\nRows with Height > 65 inch and Weight >145 lbs\n",'-'*55, sep='')
print(df[(booldf1) & (booldf2)])

Rows with Height > 65 inch and Weight >145 lbs
-------------------------------------------------------
   Age  Height  Weight Profession
B   42      70     148    Teacher
D   35      68     160     Doctor

In [80]:
print("\nDataFrame with only Age and Weight columns whose Height > 65 inch\n",'-'*68, sep='')
print(df[booldf1][['Age','Weight']])

DataFrame with only Age and Weight columns whose Height > 65 inch
--------------------------------------------------------------------
   Age  Weight
A   22     140
B   42     148
D   35     160

In [101]:
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']

In [102]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nThe DataFrame\n",'-'*25, sep='')
print(df)

The DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [103]:
print("\nAfter resetting index\n",'-'*35, sep='')
print(df.reset_index())

After resetting index
-----------------------------------
  index  Age  Height  Weight
0     A   22      66     140
1     B   42      70     148
2     C   30      62     125
3     D   35      68     160
4     E   25      62     152

In [84]:
print("\nAfter resetting index with 'drop' option TRUE\n",'-'*45, sep='')
print(df.reset_index(drop=True))

After resetting index with 'drop' option TRUE
---------------------------------------------
   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

In [104]:
print("\nAdding a new column 'Profession'\n",'-'*45, sep='')
df['Profession'] = "Student Teacher Engineer Doctor Nurse".split()
print(df)

Adding a new column 'Profession'
---------------------------------------------
   Age  Height  Weight Profession
A   22      66     140    Student
B   42      70     148    Teacher
C   30      62     125   Engineer
D   35      68     160     Doctor
E   25      62     152      Nurse

In [86]:
print("\nSetting 'Profession' column as index\n",'-'*45, sep='')
print (df.set_index('Profession'))

Setting 'Profession' column as index
---------------------------------------------
            Age  Height  Weight
Profession
Student      22      66     140
Teacher      42      70     148
Engineer     30      62     125
Doctor       35      68     160
Nurse        25      62     152

In [109]:
#multi-indexing
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

In [110]:
print("\nTuple pairs after the zip and list command\n",'-'*45, sep='')
print(hier_index)

Tuple pairs after the zip and list command
---------------------------------------------
[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [89]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
print("\nIndex hierarchy\n",'-'*25, sep='')
print(hier_index)

Index hierarchy
-------------------------
MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [90]:
print("\nIndex hierarchy type\n",'-'*25, sep='')
print(type(hier_index))

Index hierarchy type
-------------------------
<class 'pandas.core.indexes.multi.MultiIndex'>

In [91]:
print("\nCreating DataFrame with multi-index\n",'-'*37, sep='')
np.random.seed(101)
df1 = pd.DataFrame(data=np.round(rn(6,3),2), index= hier_index, columns= ['A','B','C'])
print(df1)

Creating DataFrame with multi-index
-------------------------------------
         A     B     C
G1 1  2.71  0.63  0.91
   2  0.50  0.65 -0.32
   3 -0.85  0.61 -2.02
G2 1  0.74  0.53 -0.59
   2  0.19 -0.76 -0.93
   3  0.96  0.19  1.98

In [114]:
print("\nSubsetting multi-index DataFrame using two 'loc' methods\n",'-'*60, sep='')
print(df1.loc['G1'].loc[[3]][['B']])

Subsetting multi-index DataFrame using two 'loc' methods
------------------------------------------------------------
          B
Inner
3      0.61

In [113]:
df1.loc['G2'].loc[[1,3]][['B','C']]

          B     C
Inner
1      0.53 -0.59
3      0.19  1.98

In [93]:
print("\nNaming the indices by 'index.names' method\n",'-'*45, sep='')
df1.index.names=['Outer', 'Inner']
print(df1)

Naming the indices by 'index.names' method
---------------------------------------------
                A     B     C
Outer Inner
G1    1      2.71  0.63  0.91
      2      0.50  0.65 -0.32
      3     -0.85  0.61 -2.02
G2    1      0.74  0.53 -0.59
      2      0.19 -0.76 -0.93
      3      0.96  0.19  1.98

In [94]:
#cross tabulation like pivot table

In [95]:
print("\nGrabbing a cross-section from outer level\n",'-'*45, sep='')
print(df1.xs('G1'))

Grabbing a cross-section from outer level
---------------------------------------------
          A     B     C
Inner
1      2.71  0.63  0.91
2      0.50  0.65 -0.32
3     -0.85  0.61 -2.02

In [115]:
print("\nGrabbing a cross-section from inner level (for all outer levels)\n",'-'*65, sep='')
print(df1.xs(2,level='Inner'))

Grabbing a cross-section from inner level (for all outer levels)
-----------------------------------------------------------------
          A     B     C
Outer
G1     0.50  0.65 -0.32
G2     0.19 -0.76 -0.93